MyAdmin/LogFile/LogData_03062013_RESEND_MT.vai

03/06/2013 - 15:36:08 || fxvoacebe5cq0055b0yngw55 || REQUEST XML --> <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com/schema/osg/common/v2_1"><tns:spId>005537</tns:spId><tns:spPassword>da3ec82c2934e66c5406c204879c3ef5</tns:spPassword><tns:timeStamp>1370248565612</tns:timeStamp><tns:serviceId>0055372000008373</tns:serviceId><tns:OA>841257034555</tns:OA></tns:RequestSOAPHeader></soapenv:Header><soapenv:Body><ns3:sendSms xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:addresses>tel:841257034555</ns3:addresses><ns3:senderName>1546</ns3:senderName><ns3:message>10h55: Mat do cao, cac phuong tien di chuyen duoc tren pho: Bach Mai, Thanh Nhan; Ly Nam De, Dien Bien Phu.; duong Xuan Thuy, nga tu Xuan Thuy - Nguyen Phong Sac; pho Thai Ha. Cac phuong tien di chuyen binh thuong tren Cau To va nga ba Ta Thanh Oai - Phan Trong Tue; Ql5; doan tu nga tu Sai Dong den nga ba Viet Hung.</ns3:message></ns3:sendSms></soapenv:Body></soapenv:Envelope>
03/06/2013 - 15:36:08 || fxvoacebe5cq0055b0yngw55 || RESPONSE XML --> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loc="http://www.csapi.org/schema/parlayx/data/sync/v1_0/local"><soapenv:Header/><soapenv:Body><loc:syncOrderRelationResponse><loc:result>7999</loc:result><loc:resultDescription>System internal error</loc:resultDescription></loc:syncOrderRelationResponse></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:12:38 || fxvoacebe5cq0055b0yngw55 || REQUEST XML --> <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com/schema/osg/common/v2_1"><tns:spId>005537</tns:spId><tns:spPassword>39acb03fc98c014e684f9e5a65e90bf5</tns:spPassword><tns:timeStamp>1370250757212</tns:timeStamp><tns:serviceId>0055372000008373</tns:serviceId><tns:OA>841257034555</tns:OA></tns:RequestSOAPHeader></soapenv:Header><soapenv:Body><ns3:sendSms xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:addresses>tel:841257034555</ns3:addresses><ns3:senderName>1546</ns3:senderName><ns3:message>10h55: Mat do cao, cac phuong tien di chuyen duoc tren pho: Bach Mai, Thanh Nhan; Ly Nam De, Dien Bien Phu.; duong Xuan Thuy, nga tu Xuan Thuy - Nguyen Phong Sac; pho Thai Ha. Cac phuong tien di chuyen binh thuong tren Cau To va nga ba Ta Thanh Oai - Phan Trong Tue; Ql5; doan tu nga tu Sai Dong den nga ba Viet Hung.</ns3:message></ns3:sendSms></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:12:38 || fxvoacebe5cq0055b0yngw55 || RESPONSE XML --> <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:loc="http://www.csapi.org/schema/parlayx/data/sync/v1_0/local"><soapenv:Header/><soapenv:Body><loc:syncOrderRelationResponse><loc:result>7999</loc:result><loc:resultDescription>System internal error</loc:resultDescription></loc:syncOrderRelationResponse></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:30:06 || fxvoacebe5cq0055b0yngw55 || REQUEST XML --> <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com/schema/osg/common/v2_1"><tns:spId>005537</tns:spId><tns:spPassword>07e02c56bbe742040c52ec9de2ac224c</tns:spPassword><tns:timeStamp>1370251791332</tns:timeStamp><tns:serviceId>0055372000008373</tns:serviceId><tns:OA>84943279789</tns:OA></tns:RequestSOAPHeader></soapenv:Header><soapenv:Body><ns3:sendSms xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:addresses>tel:84943279789</ns3:addresses><ns3:senderName>1546</ns3:senderName><ns3:message>10h55: Mat do cao, cac phuong tien di chuyen duoc tren pho: Bach Mai, Thanh Nhan; Ly Nam De, Dien Bien Phu.; duong Xuan Thuy, nga tu Xuan Thuy - Nguyen Phong Sac; pho Thai Ha. Cac phuong tien di chuyen binh thuong tren Cau To va nga ba Ta Thanh Oai - Phan Trong Tue; Ql5; doan tu nga tu Sai Dong den nga ba Viet Hung.</ns3:message></ns3:sendSms></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:30:06 || fxvoacebe5cq0055b0yngw55 || RESPONSE XML --> <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns3:sendSmsResponse xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:result>06030916371310005602</ns3:result></ns3:sendSmsResponse></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:31:13 || fxvoacebe5cq0055b0yngw55 || REQUEST XML --> <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com/schema/osg/common/v2_1"><tns:spId>005537</tns:spId><tns:spPassword>b14b9810ec405bc9ae05465a6e532092</tns:spPassword><tns:timeStamp>1370251817146</tns:timeStamp><tns:serviceId>0055372000008373</tns:serviceId><tns:OA>84943279789</tns:OA></tns:RequestSOAPHeader></soapenv:Header><soapenv:Body><ns3:sendSms xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:addresses>tel:84943279789</ns3:addresses><ns3:senderName>1546</ns3:senderName><ns3:message>10h55: Mat do cao, cac phuong tien di chuyen duoc tren pho: Bach Mai, Thanh Nhan; Ly Nam De, Dien Bien Phu.; duong Xuan Thuy, nga tu Xuan Thuy - Nguyen Phong Sac; pho Thai Ha. Cac phuong tien di chuyen binh thuong tren Cau To va nga ba Ta Thanh Oai - Phan Trong Tue; Ql5; doan tu nga tu Sai Dong den nga ba Viet Hung.</ns3:message></ns3:sendSms></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:31:13 || fxvoacebe5cq0055b0yngw55 || RESPONSE XML --> <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns3:sendSmsResponse xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:result>06030917031310005613</ns3:result></ns3:sendSmsResponse></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:33:03 || fxvoacebe5cq0055b0yngw55 || REQUEST XML --> <?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Header><tns:RequestSOAPHeader xmlns:tns="http://www.huawei.com/schema/osg/common/v2_1"><tns:spId>005537</tns:spId><tns:spPassword>f88d4c7b305b1f8c77511617865cb365</tns:spPassword><tns:timeStamp>1370251977347</tns:timeStamp><tns:serviceId>0055372000008314</tns:serviceId><tns:OA>84943279789</tns:OA></tns:RequestSOAPHeader></soapenv:Header><soapenv:Body><ns3:sendSms xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:addresses>tel:84943279789</ns3:addresses><ns3:senderName>1546</ns3:senderName><ns3:message>10h50: QL32, doan tu DH Thanh Do den Cau Dien cac phuong tien luu thong binh thuong; doan qua duong tau mat do cao, cac phuong tien di chuyen cham.  Mat do cao, cac phuong tien di chuyen duoc tren duong Cau Dien, Ho Tung Mau va gam cau vuot Mai Dich; nga ba Giai Phong - Nguyen Huu Tho.  Mat do cao, cac phuong tien di chuyen kho khan tren duong La Thanh doan qua Vien Nhi va Vien Phu San.</ns3:message></ns3:sendSms></soapenv:Body></soapenv:Envelope>
03/06/2013 - 16:33:03 || fxvoacebe5cq0055b0yngw55 || RESPONSE XML --> <?xml version='1.0' encoding='UTF-8'?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"><soapenv:Body><ns3:sendSmsResponse xmlns:ns3="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"><ns3:result>06030919431310005673</ns3:result></ns3:sendSmsResponse></soapenv:Body></soapenv:Envelope>
