logs/sender_service_20150607.log

2015-06-07T01:00:30+02:00|DEBUG|send|Ssg\Controller\SendController|sms|send-sms-request|6013202000002998|||tel:254723624727|901|11151||Thank you for subscribing to our service.
2015-06-07T01:00:31+02:00|DEBUG|send|Ssg\Core\SDP|sendSms|6013202000002998|send-sms|http://196.201.216.14:8310/SendSmsService/services/SendSms||<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"> <soapenv:Header> <v2:RequestSOAPHeader><spId>601320</spId><spPassword>2295cea4b9ff68bf68510727bad440c8</spPassword><serviceId>6013202000002998</serviceId><timeStamp>20150607010030</timeStamp><v2:OA>tel:254723624727</v2:OA><v2:FA>tel:254723624727</v2:FA></v2:RequestSOAPHeader></soapenv:Header><soapenv:Body><loc:sendSms><loc:addresses>tel:254723624727</loc:addresses><loc:senderName>901</loc:senderName><loc:message>Thank you for subscribing to our service.</loc:message><loc:receiptRequest><endpoint>http://41.222.9.250:49200/ssg/delivery/receipt/</endpoint><interfaceName>SmsNotification</interfaceName><correlator>11151</correlator></loc:receiptRequest></loc:sendSms></soapenv:Body></soapenv:Envelope>
2015-06-07T01:00:31+02:00|DEBUG|send|Ssg\Model\SendModel|preProcess|sdp-result|6013202000002998|||tel:254723624727|901|11151||Thank you for subscribing to our service.|http://41.222.9.250:49200/ssg/delivery/receipt/|0|Operation Successful.
2015-06-07T01:00:32+02:00|INFO|send|Ssg\Controller\SendController|sms|send-sms-result|6013202000002998|||tel:254723624727|901|11151||Thank you for subscribing to our service.|0|Processing successful|100001200501150606230039018521|2|SENT[Message sent]
2015-06-07 19:03:51,972|DEBUG|send|Ssg\Controller\SendController|sms|send-sms-request|6013202000002998|||tel:254723624727|901|11151||Thank you for subscribing to our service.
2015-06-07 19:04:05,184|DEBUG|send|Ssg\Core\SDP|sendSms|6013202000002998|send-sms|http://196.201.216.14:8310/SendSmsService/services/SendSms||<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.huawei.com.cn/schema/common/v2_1" xmlns:loc="http://www.csapi.org/schema/parlayx/sms/send/v2_2/local"> <soapenv:Header> <v2:RequestSOAPHeader><spId>601320</spId><spPassword>5f7337e0cd44875e4e6731b7ebb3785a</spPassword><serviceId>6013202000002998</serviceId><timeStamp>20150607190352</timeStamp><v2:OA>tel:254723624727</v2:OA><v2:FA>tel:254723624727</v2:FA></v2:RequestSOAPHeader></soapenv:Header><soapenv:Body><loc:sendSms><loc:addresses>tel:254723624727</loc:addresses><loc:senderName>901</loc:senderName><loc:message>Thank you for subscribing to our service.</loc:message><loc:receiptRequest><endpoint>http://41.222.9.250:49200/ssg/delivery/receipt/</endpoint><interfaceName>SmsNotification</interfaceName><correlator>11151</correlator></loc:receiptRequest></loc:sendSms></soapenv:Body></soapenv:Envelope>
2015-06-07 19:04:05,187|DEBUG|send|Ssg\Model\SendModel|preProcess|sdp-result|6013202000002998|||tel:254723624727|901|11151||Thank you for subscribing to our service.|http://41.222.9.250:49200/ssg/delivery/receipt/|0|Operation Successful.
2015-06-07 19:04:05,624|INFO|send|Ssg\Controller\SendController|sms|send-sms-result|6013202000002998|||tel:254723624727|901|11151||Thank you for subscribing to our service.|0|Processing successful|100001200101150607160413019391|2|SENT[Message sent]
